testing-scripts/test_multi-client_unencrypted_h2load_throughput_via-B/results/payload-size_1000000____delay-ms_1____loss-rate-percent_0.01____clients-requests_10/3/result.txt
Setting null encryption
starting benchmark...
spawning thread #0: 10 total client(s). 10 total requests
[WARNING! Using Null-encryption]
[WARNING! Using Null-encryption]
[WARNING! Using Null-encryption]
[...]
TLS Protocol: TLSv1.3
Cipher: TLS_AES_128_GCM_SHA256
Server Temp Key: X25519 253 bits
Application protocol: h3
progress: 10% done
progress: 20% done
progress: 30% done
progress: 40% done
progress: 50% done
progress: 60% done
progress: 70% done
progress: 80% done
progress: 90% done
progress: 100% done

finished in 74.06ms, 135.03 req/s, 128.82MB/s
requests: 10 total, 10 started, 10 done, 10 succeeded, 0 failed, 0 errored, 0 timeout
status codes: 10 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 9.54MB (10003820) total, 120B (120) headers (space savings 87.23%), 9.54MB (10000000) data
UDP datagram: 643 sent, 8246 received
                     min         max         mean         sd        +/- sd
time for request:    45.12ms     64.28ms     54.72ms      6.63ms    70.00%
time for connect:     6.24ms     28.38ms     17.18ms      7.57ms    60.00%
time to 1st byte:    28.11ms     31.05ms     29.50ms      1.03ms    60.00%
req/s           :      13.59       14.23       13.89        0.22    60.00%